perf/accounts-put.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  http:
    pool: 50

  phases:
    - name: Warm up
      duration: 20
      arrivalRate: 2
    - name: Ramp up
      duration: 60
      arrivalRate: 2
      rampTo: 25
    - name: Peak
      duration: 90
      arrivalRate: 25
    - name: Recovery
      duration: 30
      arrivalRate: 5

scenarios:
  - name: PUT /accounts/1/balance
    flow:
      - put:
          url: '/accounts/1/balance'
          json:
            balance: 120000000