perf/exchange-concurrency.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-exchange-redis"

  http:
    pool: 50

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 60
      arrivalRate: 5

# Reload internal ARS/USD accounts so the run measures exchange latency,
# not instant "not enough funds" rejections after balances are drained.
before:
  flow:
    - put:
        url: '/accounts/1/balance'
        json:
          balance: 1000000000000
    - put:
        url: '/accounts/2/balance'
        json:
          balance: 1000000000000

# Both flows below exchange between the same two internal accounts (USD <-> ARS),
# on purpose: this is what makes concurrent exchanges contend for the same
# accounts and exposes the check-then-act race on their balances.
scenarios:
  - name: Exchange (USD -> ARS)
    weight: 1
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: 'USD'
            counterCurrency: 'ARS'
            baseAccountId: 'client-{{ $randomNumber(1, 10000) }}'
            counterAccountId: 'client-{{ $randomNumber(1, 10000) }}'
            baseAmount: 10

  - name: Exchange (ARS -> USD)
    weight: 1
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: 'ARS'
            counterCurrency: 'USD'
            baseAccountId: 'client-{{ $randomNumber(1, 10000) }}'
            counterAccountId: 'client-{{ $randomNumber(1, 10000) }}'
            baseAmount: 1000