perf/exchange.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-exchange"

  http:
    pool: 50

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 60
      arrivalRate: 5

before:
  flow:
    - put:
        url: '/accounts/1/balance'
        json:
          balance: 1000000000000 # ARS interna, para que no se agote durante la prueba

scenarios:
  - name: Exchange USD to ARS
    weight: 5
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: USD
            counterCurrency: ARS
            baseAccountId: 100
            counterAccountId: 101
            baseAmount: 100
  - name: Exchange EUR to ARS
    weight: 3
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: EUR
            counterCurrency: ARS
            baseAccountId: 100
            counterAccountId: 101
            baseAmount: 50
  - name: Exchange BRL to ARS
    weight: 2
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: BRL
            counterCurrency: ARS
            baseAccountId: 100
            counterAccountId: 101
            baseAmount: 200