perf/rates.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  http:
    pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm up
      duration: 20
      arrivalRate: 2
    - name: Ramp up
      duration: 60
      arrivalRate: 2
      rampTo: 25
    - name: Peak
      duration: 90
      arrivalRate: 25
    - name: Recovery
      duration: 30
      arrivalRate: 5

scenarios:
  - name: Rates (/rates)
    flow:
      - get:
          url: '/rates'